---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LayoutRule Properties
LayoutRule Class See Also Send Feedback
---

The LayoutRule type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |

# See Also

LayoutRule Class

Autodesk.Revit.DB Namespace